[
  { "author": "Linus Torvalds", "quote": "Talk is cheap. Show me the code." },
  {
    "author": "Harold Abelson",
    "quote": "Programs must be written for people to read, and only incidentally for machines to execute."
  },
  {
    "author": "Grace Hopper",
    "quote": "The most damaging phrase in the language is: 'It's always been done that way.'"
  },
  {
    "author": "John Johnson",
    "quote": "First, solve the problem. Then, write the code."
  },
  {
    "author": "Martin Fowler",
    "quote": "Any fool can write code that a computer can understand. Good programmers write code that humans can understand."
  },
  {
    "author": "Donald Knuth",
    "quote": "Premature optimization is the root of all evil."
  },
  {
    "author": "Bjarne Stroustrup",
    "quote": "There are only two kinds of programming languages: the ones people complain about and the ones nobody uses."
  },
  {
    "author": "Alan Turing",
    "quote": "A computer would deserve to be called intelligent if it could deceive a human into believing that it was human."
  },
  {
    "author": "Edsger W. Dijkstra",
    "quote": "Simplicity is prerequisite for reliability."
  },
  { "author": "Ken Thompson", "quote": "When in doubt, use brute force." },
  {
    "author": "Dennis Ritchie",
    "quote": "Unix is simple. It just takes a genius to understand its simplicity."
  },
  {
    "author": "Steve Jobs",
    "quote": "Innovation is the ability to see change as an opportunity – not a threat."
  },
  {
    "author": "Bill Gates",
    "quote": "Your most unhappy customers are your greatest source of learning."
  },
  {
    "author": "Tim Berners-Lee",
    "quote": "We need diversity of thought in the world to face the new challenges."
  },
  {
    "author": "Brian Kernighan",
    "quote": "Debugging is twice as hard as writing the code in the first place. Therefore, if you write the code as cleverly as possible, you are, by definition, not smart enough to debug it."
  },
  {
    "author": "Guido van Rossum",
    "quote": "Code is read much more often than it is written."
  },
  {
    "author": "Paul Graham",
    "quote": "The most important quality in a programmer is the ability to deal with ambiguity."
  },
  {
    "author": "Alan Perlis",
    "quote": "A language that doesn't affect the way you think about programming is not worth knowing."
  },
  {
    "author": "Douglas Crockford",
    "quote": "JavaScript is the world's most misunderstood programming language."
  },
  {
    "author": "Jeff Atwood",
    "quote": "Code never lies, comments sometimes do."
  },
  {
    "author": "David Wheeler",
    "quote": "Any problem in computer science can be solved with another layer of indirection."
  },
  {
    "author": "Richard Stallman",
    "quote": "Free software is a matter of liberty, not price."
  },
  {
    "author": "Ada Lovelace",
    "quote": "The science of operations, as derived from mathematics more especially, is a science of itself, and has its own abstract truth and value."
  },
  {
    "author": "Margaret Hamilton",
    "quote": "I began to use the term 'software engineering' to distinguish it from hardware and other kinds of engineering."
  },
  {
    "author": "Elon Musk",
    "quote": "I think it is possible for ordinary people to choose to be extraordinary."
  },
  {
    "author": "Donald Knuth",
    "quote": "The best programs are written so that computing machines can perform them quickly and so that human beings can understand them clearly."
  },
  {
    "author": "Edsger W. Dijkstra",
    "quote": "The question of whether a computer can think is no more interesting than the question of whether a submarine can swim."
  },
  { "author": "Larry Page", "quote": "Always deliver more than expected." },
  {
    "author": "Linus Torvalds",
    "quote": "Intelligence is the ability to avoid doing work, yet getting the work done."
  },
  {
    "author": "Yukihiro Matsumoto",
    "quote": "I hope to see Ruby help every programmer in the world to be productive, and to enjoy programming, and to be happy. That is the primary purpose of Ruby language."
  },
  {
    "author": "Grace Hopper",
    "quote": "A ship in port is safe, but that is not what ships are built for. Sail out to sea and do new things."
  },
  {
    "author": "Mark Zuckerberg",
    "quote": "The biggest risk is not taking any risk."
  },
  {
    "author": "Sundar Pichai",
    "quote": "Wear your failure as a badge of honor."
  },
  {
    "author": "Phil Karlton",
    "quote": "There are only two hard things in Computer Science: cache invalidation and naming things."
  },
  {
    "author": "Edsger W. Dijkstra",
    "quote": "Testing shows the presence, not the absence of bugs."
  },
  { "author": "Steve Jobs", "quote": "Stay hungry, stay foolish." },
  {
    "author": "Dennis Ritchie",
    "quote": "C is quirky, flawed, and an enormous success."
  },
  {
    "author": "Guido van Rossum",
    "quote": "Python is an experiment in how much freedom programmers need. Too much freedom and nobody can read another's code; too little and expressiveness is endangered."
  },
  {
    "author": "Larry Wall",
    "quote": "The three chief virtues of a programmer are: Laziness, Impatience, and Hubris."
  },
  {
    "author": "Donald Knuth",
    "quote": "Science is what we understand well enough to explain to a computer. Art is everything else we do."
  },
  {
    "author": "Richard Stallman",
    "quote": "Control over the use of one's ideas really constitutes control over other people's lives; and it is usually used to make their lives more difficult."
  },
  {
    "author": "Alan Kay",
    "quote": "The best way to predict the future is to invent it."
  },
  {
    "author": "Bjarne Stroustrup",
    "quote": "I would encourage non-programmers to learn the basics of programming because it teaches you how to think."
  },
  {
    "author": "Douglas Engelbart",
    "quote": "The rate at which a person can mature is directly proportional to the embarrassment he can tolerate."
  },
  {
    "author": "Robert C. Martin",
    "quote": "Clean code always looks like it was written by someone who cares."
  },
  {
    "author": "Ken Thompson",
    "quote": "One of my most productive days was throwing away 1,000 lines of code."
  },
  {
    "author": "Bill Gates",
    "quote": "I choose a lazy person to do a hard job. Because a lazy person will find an easy way to do it."
  },
  {
    "author": "Edsger W. Dijkstra",
    "quote": "Computer Science is no more about computers than astronomy is about telescopes."
  },
  {
    "author": "Patrick McKenzie",
    "quote": "Every great developer you know got there by solving problems they were unqualified to solve until they actually did it."
  },
  {
    "author": "Chris Pine",
    "quote": "Programming isn't about what you know; it's about what you can figure out."
  },
  {
    "author": "Donald Knuth",
    "quote": "Computers are good at following instructions, but not at reading your mind."
  },
  {
    "author": "Bill Gates",
    "quote": "Learning to write programs stretches your mind and helps you think better, creates a way of thinking about things that I think is helpful in all domains."
  },
  {
    "author": "Edsger W. Dijkstra",
    "quote": "Progress is possible only if we train ourselves to think about programs without thinking of them as pieces of executable code."
  },
  {
    "author": "Bill Gates",
    "quote": "The computer was born to solve problems that did not exist before."
  },
  {
    "author": "Nicholas Negroponte",
    "quote": "Computing is not about computers any more. It is about living."
  },
  {
    "author": "Dave Barry",
    "quote": "The Internet is the most important single development in the history of human communication since the invention of call waiting."
  },
  {
    "author": "Brian W. Kernighan",
    "quote": "Bad code can be cleaned up. Bad design will forever haunt you."
  },
  {
    "author": "Edsger W. Dijkstra",
    "quote": "If debugging is the process of removing software bugs, then programming must be the process of putting them in."
  },
  {
    "author": "Alan Kay",
    "quote": "Simple things should be simple, complex things should be possible."
  },
  {
    "author": "Steve Wozniak",
    "quote": "Never trust a computer you can&#x27;t throw out a window."
  },
  {
    "author": "Turing Award Lecture",
    "quote": "No programming language is perfect. There is not even a single best language; there are only languages well suited or perhaps poorly suited for particular purposes."
  },
  {
    "author": "Hadi Partovi",
    "quote": "Code teaches you to think. It&#x27;s a skill that every student should learn."
  },
  {
    "author": "Steve Jobs",
    "quote": "Creativity is just connecting things."
  },
  {
    "author": "Margaret Hamilton",
    "quote": "The discipline of software engineering requires continuous learning and improvement."
  },
  {
    "author": "Linus Torvalds",
    "quote": "In real open source, you have the right to control your own destiny."
  },
  {
    "author": "Edsger W. Dijkstra",
    "quote": "The tools we use have a profound and devious influence on our thinking habits, and, therefore, on our thinking abilities."
  },
  {
    "author": "Alan Perlis",
    "quote": "One man's constant is another man's variable."
  },
  {
    "author": "John Ousterhout",
    "quote": "A program is like a poem; you cannot write a poem without knowing the language, but no amount of knowledge of the language will help you write the poem."
  },
  {
    "author": "Fred Brooks",
    "quote": "The hardest single part of building a software system is deciding precisely what to build."
  },
  {
    "author": "Grace Hopper",
    "quote": "You manage things; you lead people."
  },
  {
    "author": "Ken Arnold",
    "quote": "Unix was not designed to stop its users from doing stupid things, as that would also stop them from doing clever things."
  },
  {
    "author": "Alan Turing",
    "quote": "If a machine is expected to be infallible, it cannot also be intelligent."
  },
  {
    "author": "Dennis Ritchie",
    "quote": "The only way to learn a new programming language is by writing programs in it."
  },
  {
    "author": "Ada Lovelace",
    "quote": "That brain of mine is something more than merely mortal, as time will show."
  },
  {
    "author": "Linus Torvalds",
    "quote": "Only wimps use tape backups: real men just upload their important stuff on FTP, and let the rest of the world mirror it."
  },
  {
    "author": "Paul Graham",
    "quote": "Writing software is like designing a recipe, but for a digital chef."
  },
  {
    "author": "Richard Stallman",
    "quote": "Think of free software as a free speech, not free beer."
  },
  {
    "author": "Tim Berners-Lee",
    "quote": "The Web does not just connect machines, it connects people."
  },
  {
    "author": "Douglas Crockford",
    "quote": "The main thing is to keep the main thing the main thing."
  },
  {
    "author": "Donald Knuth",
    "quote": "I don&#x27;t make mistakes. I make debugging features."
  },
  {
    "author": "Phil Karlton",
    "quote": "Abstraction is ever-present."
  },
  {
    "author": "Bjarne Stroustrup",
    "quote": "C makes it easy to shoot yourself in the foot; C++ makes it harder, but when you do, it blows your whole leg off."
  },
  {
    "author": "Fred Brooks",
    "quote": "Adding people to a late software project makes it later."
  },
  {
    "author": "Ken Thompson",
    "quote": "You can&#x27;t trust code that you did not totally create yourself."
  },
  {
    "author": "Alan Turing",
    "quote": "Sometimes it is the people no one can imagine anything of who do the things no one can imagine."
  },
  {
    "author": "Martin Fowler",
    "quote": "Refactoring is a disciplined technique for restructuring an existing body of code, altering its internal structure without changing its external behavior."
  },
  {
    "author": "Elon Musk",
    "quote": "When something is important enough, you do it even if the odds are not in your favor."
  },
  {
    "author": "Steve Wozniak",
    "quote": "Wherever smart people work, doors are unlocked."
  },
  {
    "author": "Brian Kernighan",
    "quote": "Controlling complexity is the essence of computer programming."
  },
  {
    "author": "Marissa Mayer",
    "quote": "When you need to innovate, you need collaboration."
  },
  {
    "author": "Douglas Engelbart",
    "quote": "The better we get at getting better, the faster we will get better."
  },
  {
    "author": "Rob Pike",
    "quote": "Simplicity is the key to brilliance."
  },
  {
    "author": "James Gosling",
    "quote": "The real power of Java lies not in its simplicity, but in its robustness."
  },
  {
    "author": "Dennis Ritchie",
    "quote": "I think programming is really just about thinking."
  },
  {
    "author": "Alan Perlis",
    "quote": "Fools ignore complexity. Pragmatists suffer it. Some can avoid it. Geniuses remove it."
  },
  {
    "author": "Edwin Land",
    "quote": "An essential aspect of creativity is not being afraid to fail."
  },
  {
    "author": "Jeff Bezos",
    "quote": "Invention requires a long-term willingness to be misunderstood."
  },
  {
    "author": "Margaret Hamilton",
    "quote": "The best software engineers are not just problem solvers, they are also problem finders."
  },
  {
    "author": "Yukihiro Matsumoto",
    "quote": "I wanted to create a language that made programming fun again."
  },
  {
    "author": "Bill Gates",
    "quote": "Software is a great combination of artistry and engineering."
  },
  {
    "author": "Vinton Cerf",
    "quote": "The Internet is a reflection of our society, and that mirror is going to be reflecting what we see."
  },
  {
    "author": "Linus Torvalds",
    "quote": "Software is like sex: it's better when it's free."
  },
  {
    "author": "Michael Feathers",
    "quote": "Legacy code is code without tests."
  },
  {
    "author": "Tim Berners-Lee",
    "quote": "The Web as I envisaged it, we have not seen it yet. The future is still so much bigger than the past."
  },
  {
    "author": "Brian Kernighan",
    "quote": "UNIX is basically a simple operating system, but you have to be a genius to understand the simplicity."
  },
  {
    "author": "Tony Hoare",
    "quote": "There are two ways of constructing a software design. One way is to make it so simple that there are obviously no deficiencies. The other way is to make it so complicated that there are no obvious deficiencies."
  },
  {
    "author": "Albert Einstein",
    "quote": "Any fool can know. The point is to understand."
  },
  {
    "author": "Eliezer Yudkowsky",
    "quote": "By far the greatest danger of Artificial Intelligence is that people conclude too early that they understand it."
  },
  {
    "author": "Edsger W. Dijkstra",
    "quote": "The purpose of abstraction is not to be vague, but to create a new semantic level in which one can be absolutely precise."
  }
]
